---
type: SpatialElementGeometryCalculator
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# SpatialElementGeometryCalculator

`Autodesk.Revit.DB.SpatialElementGeometryCalculator` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SpatialElementGeometryCalculator | — | `` |
| Method | CalculateSpatialElementGeometry | 2012 | `public SpatialElementGeometryResults CalculateSpatialElementGeometry ( SpatialElement spatialElement )` |
| Method | CanCalculateGeometry | 2012 | `public static bool CanCalculateGeometry ( SpatialElement spatialElement )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetOptions | 2012 | `public SpatialElementBoundaryOptions GetOptions ()` |
| Method | IsRoomOrSpace | 2012 | `public static bool IsRoomOrSpace ( SpatialElement spatialElement )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |